In [1]:
import numpy as np
import pandas as pd

In [2]:
dates = pd.date_range('1/1/2000',periods=8)

In [3]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df=pd.DataFrame(np.random.randn(8,4),index=dates,columns=['A','B','C','D'])
df

                   A         B         C         D
2000-01-01 -1.042845  0.881361 -1.016146 -0.658987
2000-01-02 -0.084463  2.686923 -0.876581  0.688594
2000-01-03 -0.164537 -0.724173 -0.225893  1.696010
2000-01-04 -1.002731 -0.901152 -0.332179 -0.218539
2000-01-05 -1.718139  0.453596 -0.314427 -1.308154
2000-01-06 -0.345347  0.055688 -0.879788  0.899313
2000-01-07 -1.176954 -0.555772 -0.759141  1.288035
2000-01-08  0.976215  1.425597  0.181136  1.056524

In [5]:
df['A']

2000-01-01   -1.042845
2000-01-02   -0.084463
2000-01-03   -0.164537
2000-01-04   -1.002731
2000-01-05   -1.718139
2000-01-06   -0.345347
2000-01-07   -1.176954
2000-01-08    0.976215
Freq: D, Name: A, dtype: float64

In [6]:
df['A'][1]

-0.0844631803732361

In [7]:
df['A'][0:3]

2000-01-01   -1.042845
2000-01-02   -0.084463
2000-01-03   -0.164537
Freq: D, Name: A, dtype: float64

In [8]:
df['A'][0::2]

2000-01-01   -1.042845
2000-01-03   -0.164537
2000-01-05   -1.718139
2000-01-07   -1.176954
Freq: 2D, Name: A, dtype: float64

In [11]:
#df.loc['A']

In [9]:
df[['A','B']]

                   A         B
2000-01-01 -1.042845  0.881361
2000-01-02 -0.084463  2.686923
2000-01-03 -0.164537 -0.724173
2000-01-04 -1.002731 -0.901152
2000-01-05 -1.718139  0.453596
2000-01-06 -0.345347  0.055688
2000-01-07 -1.176954 -0.555772
2000-01-08  0.976215  1.425597

In [10]:
df.loc[:,['B','A']]

                   B         A
2000-01-01  0.881361 -1.042845
2000-01-02  2.686923 -0.084463
2000-01-03 -0.724173 -0.164537
2000-01-04 -0.901152 -1.002731
2000-01-05  0.453596 -1.718139
2000-01-06  0.055688 -0.345347
2000-01-07 -0.555772 -1.176954
2000-01-08  1.425597  0.976215

In [11]:
x = pd.DataFrame({'x':[1,2,3], 'y':[3,4,5]})

In [12]:
x

   x  y
0  1  3
1  2  4
2  3  5

In [13]:
x.iloc[1]

x    2
y    4
Name: 1, dtype: int64

In [14]:
x.iloc[1] = {'x':99, 'y':9}

In [15]:
x

    x  y
0   1  3
1  99  9
2   3  5

In [16]:
df1 = pd.DataFrame(np.random.randn(5,4),
                  columns=list('ABCD'),
                  index=pd.date_range('1/1/2020',periods=5))

In [17]:
df1

                   A         B         C         D
2020-01-01  0.370518  0.788440  1.014813  0.502508
2020-01-02 -0.715901 -0.695406  0.917917  0.780636
2020-01-03 -2.210414  0.709096 -0.535589 -1.705117
2020-01-04  1.038378  1.378119  0.799437 -0.971170
2020-01-05  0.039098 -0.666340 -0.622598  0.460590

In [18]:
df1.loc['20200102':'20200104']

                   A         B         C         D
2020-01-02 -0.715901 -0.695406  0.917917  0.780636
2020-01-03 -2.210414  0.709096 -0.535589 -1.705117
2020-01-04  1.038378  1.378119  0.799437 -0.971170

In [19]:
df1.loc['20200101':'20200104']

                   A         B         C         D
2020-01-01  0.370518  0.788440  1.014813  0.502508
2020-01-02 -0.715901 -0.695406  0.917917  0.780636
2020-01-03 -2.210414  0.709096 -0.535589 -1.705117
2020-01-04  1.038378  1.378119  0.799437 -0.971170

In [20]:
df.loc[:,['A']] == df['A']

,2000-01-01 00:00:00,2000-01-02 00:00:00,2000-01-03 00:00:00,2000-01-04 00:00:00,2000-01-05 00:00:00,2000-01-06 00:00:00,2000-01-07 00:00:00,2000-01-08 00:00:00,A
2000-01-01,False,False,False,False,False,False,False,False,False
2000-01-02,False,False,False,False,False,False,False,False,False
2000-01-03,False,False,False,False,False,False,False,False,False
2000-01-04,False,False,False,False,False,False,False,False,False
2000-01-05,False,False,False,False,False,False,False,False,False
2000-01-06,False,False,False,False,False,False,False,False,False
2000-01-07,False,False,False,False,False,False,False,False,False
2000-01-08,False,False,False,False,False,False,False,False,False

In [21]:
df.loc[:,['B','A']] = df[['A', 'B']]

In [22]:
df

                   A         B         C         D
2000-01-01 -1.042845  0.881361 -1.016146 -0.658987
2000-01-02 -0.084463  2.686923 -0.876581  0.688594
2000-01-03 -0.164537 -0.724173 -0.225893  1.696010
2000-01-04 -1.002731 -0.901152 -0.332179 -0.218539
2000-01-05 -1.718139  0.453596 -0.314427 -1.308154
2000-01-06 -0.345347  0.055688 -0.879788  0.899313
2000-01-07 -1.176954 -0.555772 -0.759141  1.288035
2000-01-08  0.976215  1.425597  0.181136  1.056524

In [23]:
df[['A', 'B']]

                   A         B
2000-01-01 -1.042845  0.881361
2000-01-02 -0.084463  2.686923
2000-01-03 -0.164537 -0.724173
2000-01-04 -1.002731 -0.901152
2000-01-05 -1.718139  0.453596
2000-01-06 -0.345347  0.055688
2000-01-07 -1.176954 -0.555772
2000-01-08  0.976215  1.425597

In [24]:
s = pd.Series(['A', 'B', 'C','Aaba', 'Baca',np.nan, 'Caba', 'dog', 'cat'],dtype='string')

In [25]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5    <NA>
6    Caba
7     dog
8     cat
dtype: string

In [26]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5    <NA>
6    caba
7     dog
8     cat
dtype: string

In [27]:
s.str.len()

0       1
1       1
2       1
3       4
4       4
5    <NA>
6       4
7       3
8       3
dtype: Int64

In [28]:
s = pd.Series(['a','b','c','a'],dtype="category")

In [29]:
s

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]

In [30]:
df = pd.DataFrame(s)

In [31]:
df

   0
0  a
1  b
2  c
3  a

In [32]:
df['Data'] = ['M', 'F', 'M', 'F']

In [33]:
df

   0 Data
0  a    M
1  b    F
2  c    M
3  a    F

In [34]:
df.columns = ['Cap', 'Data']

In [35]:
df

  Cap Data
0   a    M
1   b    F
2   c    M
3   a    F

In [36]:
df.dtypes

Cap     category
Data      object
dtype: object

In [38]:
pd.get_dummies(df)

   Cap_a  Cap_b  Cap_c  Data_F  Data_M
0      1      0      0       0       1
1      0      1      0       1       0
2      0      0      1       0       1
3      1      0      0       1       0